

<style>

@font-face {
    font-family: "Computer Modern";
    src: url('http://mirrors.ctan.org/fonts/cm-unicode/fonts/otf/cmunss.otf');
}
#notebook_panel { /* main background */
    background: #888;
    color: #f6f6f6;
}
#notebook li { /* More space between bullet points */
margin-top:0.8em;
}
div.text_cell_render{
    font-family: 'Arvo' sans-serif;
    line-height: 110%;
    font-size: 135%;
    width:1000px;
    margin-left:auto;
    margin-right:auto;
}

</style>


<center>

<p class="gap05"<p>
<h1>Intro to SQL Workshop</h1>

<p class="gap05"<p>
<h3>Darrell Aucoin</h3>

<h3>Stats Club</h3>

<p class="gap2"<p>

</center>

<style type="text/css">
.input_prompt, .input_area, .output_prompt {
    display:none !important;
}
</style>
![alt text](Images/exploits_of_a_mom.png)
Source for picture: XKCD (Randall Munroe) http://xkcd.com/327/

In [1]:
import pandas as pd
import sqlite3 as sql
con = sql.connect('stats_club.db')

# Quick Summary of SQL  
SQL is a database programming language based on tables (_relations_) with named columns (_attributes_) and unnamed rows.

```SQL
SELECT * 
FROM example;
```

In [2]:
pd.read_sql_query(
"SELECT * \
FROM example", con)

   number  floating        string
0       1     23.23          this
1    3232    -21.23            is
2      11     -2.00             a
3     -23     54.00        string
4       2       NaN  concatenated

## Content

1. Basic Theory Behind Relational Databases
2. Projection (SELECT Clause)
3. FROM Clause
4. Selection (WHERE Clause)
5. Aggregation (GROUP BY clause)
6. Joining Tables (JOIN)
7. Subqueries
8. Set Operations
9. WITH Clause
10. Case expressions
11. LIMIT and ORDER BY Clauses

# How to Follow Along

#### Get the material

1. Go to https://github.com/NormallySane/IntroSQL
2. Download [zip file](https://github.com/NormallySane/IntroSQL/archive/master.zip)
    ![alt text](Images/IntroSQLGithub.png)
3. Unzip downloaded file in your preferred directory

#### Using SQLite Browser

1. Open SQLite browser
2. Open `stats_club.db` database file in the downloaded directory
3. Click on 'Execute SQL' tab
    1. Open SQL file `IntroSQL_Presentation.sql` file in the downloaded directory
    2. Follow along with file, executing statement as topics dictate
4. Content of the talk is on https://github.com/NormallySane/IntroSQL/wiki (open in your favorite browser)


- SQLite browser is a great tool for learning SQLite and SQL in general

#### Features of SQLite Browser

- Lets you see the data structure of tables in the database   

![alt text](Images/dataStructure.png)

- Explore the data entered in tables  

![alt text](Images/exploreData.png)

- Execute SQL statements and see results  

![alt text](Images/executeSQL.png)

- Easily construction tables from files  

![alt text](Images/Import_tables.png)

- If the table is already created it will just import the data into the table, otherwise it will create a new table

![alt text](Images/import_tables2.png)

- SQLite functionality can also be extended by [various user created extensions](http://www.sqlite.org/contrib)

# Motivation

__Q:__ Why learn a database lanugage?

- Data is rarely tidy as they are in many stats courses
- Most of the time the data we want (outside of assignments) is in a database

__Q:__ Why learn SQL?

- One of the most popular data analysis tools ([O'Reilly Data Scientist Survey for 2014](http://www.oreilly.com/data/free/2014-data-science-salary-survey.csp))
- One of the most in-demand skills for 2014 ([Workopolis](http://www.workopolis.com/content/advice/article/year-in-review-the-most-in-demand-jobs-of-2014-and-the-fastest-declining-occupations?CID=721:19L:14946))
- SQL not only can retrieve data, but can slice, dice and transform the data as needed

__Q:__ What is SQL?

- A programming language allowing multiple concurrent users storing, manipulating, and querying data stored in a relational database.
- Data does not necessary have to fit into memory.

__Q:__ Why use SQLite?

- Very easy to install
- Easy to share (database is a single file)
- Good  SQL language to practice with (can easily use it to preprocess data for kaggle competitions)

## Different Implementations of SQL

__[MySQL](http://www.mysql.com/):__ Highly popular open source SQL implementation.

__[PostgreSQL](http://www.postgresql.org/):__ Open source SQL designed around letting users create User Defined Functions (UDF).

__[SQLite](http://www.sqlite.org/):__ Open sources light weight SQL usually used as an embedded database for applications (web browsers, mobile applications, etc.), or light to medium traffic websites.

__[Oracle](http://www.oracle.com/ca-en/database/overview/index.html):__ SQL implementation produced and marketed by Oracle Corporation.

__[Microsoft SQL Server](http://www.microsoft.com/en-ca/server-cloud/products/sql-server/):__ SQL implementation developed by Microsoft.

__[DB2](http://www-01.ibm.com/software/data/db2/):__ SQL developed by IBM. The database used by University of Waterloo.

# Relational Databases

__Relational Database:__ A relational database is a system organized in tables containing records (rows) related to other records in other tables. Each entity having attributes (columns also called fields) which give additional information on an entity. 

![alt text](Images/RelationalDatabase.png)

__Field, Attribute (Column)__: An individual piece of data stored in a table.

![alt text](Images/RelationalDatabase.png)

__Record (Row):__ A tuple of columns describing an entity or action of an entity.

__Table (Relation):__ A collection of rows. Usually in reference a persistent table saved permanently to memory

__Result set:__ A non-persistent table, usually the result of a query.

![alt text](Images/RelationalDatabase.png)

__(Virtual) View:__ A named query saved into memory and performed whenever it is named. Some SQL servers have materialized views that permanently save the data for faster access.

__Subquery:__ A query that returns a table to another query.

![alt text](Images/RelationalDatabase.png)

__Primary key:__ A tuple of columns that uniquely define each row in a table.

__Foreign key:__ A tuple of columns identifying a relationship to another table.

## The E-R Model

The E-R (entity-relationship) Model is an _analysis tool_ for relational databases.  
__E__ refers to _entity_: An object  
__R__ refers to _relationship_: As in how objects relate to each other.

Each entity has properties associated with every instance of an object.

![alt text](Images/ER_Model.png)

Objects are related to each other through relationships:

![alt text](Images/ER_Model2.png)

### E-R Relationships

1. __One to one relationships:__ For every instance of object A, there are exactly one instance of object B.
    - Every student has exactly one quest account
2. __One to many relationships:__ For every instance of object A, there are an indeterminate number of instances of object B.
    - A single course section has many students

3. __Many to one relationships:__ For many instances of object A, there are a single instance of object B.
    - Many students are enrolled in a course section

4. __Many to many relationships:__ For many instances of object A, there are a many possible instances of object B.
    - Many students take many courses

## Normalization

__Database Normalization__ is a process in relational databases to minimize redundacy. Data can be constructed so that additions, deletions, and modifications can be made in just one table.  

Data goes through three forms until it is fully utilizied by a  relational database:

1. __First Normalized Form:__ 
    - A two-dimensional table
    - All entries are the same datatype
    - Each row, column pair contains only a single value
    - Each row is unique
2. __Second Normalized Form:__ 
    - Each attribute in the table is dependent on the entity it is describing (dependent on the primary key)
    $$A\rightarrow B,C $$
3. __Third Normalized Form:__ 
    - All non-primary key attributes are not determined by any other non-primary key attributes
    $$\begin{cases}
A\rightarrow B,C\\
A,B\rightarrow D
\end{cases}\implies\mbox{Need at least 2 tables}$$

__Example:__ For each event for Stats Club we have:
1. a list of attendies along with some basic information (email, ect.), 
2. the event's name, type (social or education), the roles for Stats Club execs for the event, time and location of the event, and a budget,
3. as well as a list of expenses for the event  

A report of the event would look something like:

![alt text](Images/Event_report.png)

We first need to tabulate the data:

![alt text](Images/Event_report_table.png)

However this is not enough, the data is not in a form that can be easily recognized by computers.
- How do you add new events?
- What about members that attend multiple events?
    - that attend no events?

### 1st Normalization

__First Normalized Form:__ Each attribute contains only atomic values and only a single value from that domain

__Example:__ To bring the data into 1st normalized form we need to break the table into two tables: Event, and Expenses:

![alt text](Images/Event_report_table_1st.png)
- This contains all of the information before but is more organized for the computers to deal with
- Still not enough, a mispelling of an event or type could make the database think there is a new event

### 2nd Normalization

__Second Normalized Form:__ Each attribute in the table is dependent on the entity it is describing (dependent on the primary key).

__Example:__ To bring the data into 2nd normalized form, we need to break the Event table again. 
Let's break the table so we get important description of the events (name, type, presenter, organizer, etc.) and a list of members that attended each event.

![alt text](Images/Event_report_table_2nd.png)
- Attendance is 2nd normalized form if we consider the primary key as the tuple of event and quest ID.
- Attendance still has redundant information, several members can attend multiple events or none at all

### 3rd Normalization

__Third Normalized Form:__ All non-primary key attributes are not determined by any other non-primary key attributes.

__Example:__ The information on each member (name, email, etc.) is not determined by the event. We need to break the attendance table to bring into 3rd normalized form: attendance and members.

![alt text](Images/Event_report_table_3rd.png)

### Primary Keys and Foriegn Keys

We can reconstruct the orignal table by joining tables, foreign keys with what they reference (primary keys).
- We can only construct an instance of a foreign key if there is already an instance of their reference
    - i.e. the set of foreign keys for one table is a subset of the primary keys they reference

__Primary key:__ A tuple of columns that uniquely define each row in a table. (Red items below)  
__Foreign key:__ A tuple of columns identifying a relationship to another table. (Blue items below)
![alt text](Images/primary_keys.png)

### Quiz: Normalization

Normalize the following table:  

| Student Name | Quest ID | Course | Description | Section |
|--------------|----------|--------|-------------|---------|
| | | | | |

![alt text](Images/quiz1sol.png)

## Relational Algebra Operations
Regular algebra:
$$x\frac{\left(x+y\right)}{z}+x$$

- We can manipulate in many different ways without changing it's fundamental meaning.

- Computers can do these manipulations as well (see symbolic computation). Doing so is usually more costly than calculating the expression.

- Same with relations (tables) and relational algrebra.
  - This is the heart of the SQL optimization engine and why you rarely have to worry about optimizing a query.

__Projection:__ Returns a subset of columns.

__Selection:__ Returns only entities where some condition is true.

__Rename:__ Rename an attribute.

__Natural Join:__ Tuples from one table is joined to tuples from another table based on common attributes (at least one column with the same name and possible values is common between them)

Θ__-Join and Equijoin:__ Join tuples from two different tables where some binary condition (Θ = {≥, ≤, >, <, =}) between two tables attributes is true. When Θ is =, the join is called an equijoin.  
$$\theta=\left\{ \ge,\le,<,>,=\right\}$$

__Set Operations:__ Set theory's unions, set difference, and cartesian product of tuples performed on tuples of different tables.

### Quiz: Relational Algebra

__Q1:__ What kind of operation is performed on the following tables?
![alt text](Images/quiz2a.png)

__Table A:__ Projection  
__Table B:__ Selection

__Q2:__ What kinds of joins can be performed on tables?

- Natural Join: Join based on common columns
- Θ-Join: Join based on a comparison operator between two columns
    - Equijoin: Join based on equality between columns

## Constraints

Constraints limit what can be entered into fields in a table and help ensure encapsulation:

__PRIMARY KEY constraints__  Uniquely identifies each record in a table (quickly referencing it)

__FOREIGN KEY constraints__ Points to a PRIMARY KEY of another table, enabling them to easily join them

__CHECK constraints__ Limits the range of values that a field can take.

__UNIQUE constraints__ Enforces uniqueness on an field (column).

__NOT NULL constraints__  Enforces a field to always contain a value.

# SQL Language

- Case does not matter, for presentation purposes UPPER CASE is used for SQL key words  
- SQL statements are processed as a whole (ignoring white space and new lines) and ends with a ';'

- We will be used a database based on Stats Club, supplied with fake data:
![alt text](Images/StatClubTables.png)

## Data Types

In SQLite3, there are 5 basic data types:

1. __INTEGER__ The value is a signed integer.

2. __REAL__ The value is a floating point value, stored as an 8-byte IEEE floating point number.

3. __TEXT__ The value is a text string.

4. __BLOB__ The value is a blob of data, stored exactly as it was input.

5. __NUMERIC__ May contain integer or real values. The data is stored as text but converted as necessary.

### SQL General Data Types

- Different implementations of SQL uses different datatypes but there are some [general commonalities](http://www.w3schools.com/sql/sql_datatypes_general.asp):

| Data type | Description |
|-----------|-------------|
| CHAR(n) | Character string. Fixed length n |
| VARCHAR(n) | Character string.  Variable length <= n |
| BINARY(n) | Binary string. Fixed length n |
| BOOLEAN | TRUE or FALSE values |
| VARBINARY(n) | Binary string. Variable length <= n |
| INTEGER(p) | Integer numerical (no decimal). Precision p |
| SMALLINT | Integer numerical (no decimal). Precision 5 |
| INTEGER | Integer numerical (no decimal). Precision 10 |
| BIGINT | Integer numerical (no decimal). Precision 19 |
| DECIMAL(p,s) | Exact numerical. precision p, scale s |

| Data type | Description |
|-----------|-------------|
| NUMERIC(p,s) | Exact numerical. precision p, scale s |
| FLOAT(p) | Floating point number. mantissa precision p |
| REAL | Approximate numerical. Mantissa percision 7 |
| FLOAT | Approximate numerical. Mantissa percision 16 |
| DATE | Stores year, month, and day values |
| TIME | Stores hour, minute, and second values |
| TIMESTAMP | Stores year, month, day, hour, minute, and second values |

### NULL Values

__NULL__ A NULL can be thought of as an unknown value.
- Any datatype can have NULL values

- if either x or y is NULL:
$$x+y\implies\mbox{NULL}$$
$$x>y\implies\mbox{NULL}$$

SQL uses a three-value logic system: TRUE, FALSE, NULL:  

| AND | TRUE | FALSE | NULL |
|-----|------|-------|------|
| TRUE | T | F | NULL | 
| FALSE | F | F | F | 
| NULL | NULL | F | NULL |

| OR | TRUE | FALSE | NULL |
|-----|------|-------|------|
| TRUE | T | T | T | 
| FALSE | T | F | NULL | 
| NULL | T | NULL | NULL |

| NOT | TRUE | FALSE | NULL |
|-----|------|-------|------|
|  | F | T | NULL |

## Projection (SELECT Clause)

__SELECT Statement:__ The SELECT statement returns a table of values (sometimes empty) as specified in the statement.  

__SELECT Clause:__ The SELECT clause of a SELECT statement specifies the columns for the result set.
```SQL
SELECT col1, col2, ...
FROM table_name;
```

- We can also specify all columns from a table  

```SQL
SELECT *
FROM table_name;
```

- If we leave out '`FROM table`' we are effectively taking from an empty table

In SELECT clauses, we can specify more than just columns from a table:  
__Literials:__ Strings, numbers that are repeated for every row  
__Expressions:__ Expressions of columns/literals  
__Functions:__ Built in functions in SQL (ROUND(), etc.)  
__User Defined Functions:__ Functions that a user can create within SQL to run

__Example:__ Let's try something simple: some literials and a calculation of `1 / 2`

```SQL
SELECT 1, 2, 'this is a string', 1/2;
```

In [3]:
pd.read_sql_query(
"SELECT 1, 2, 'this is a string', 1/2", con)

   1  2 'this is a string'  1/2
0  1  2   this is a string    0

__Q:__ What happened here?  

__A:__ Since 1 and 2 are both integers, the expression 1/2 returns an integer. To get 0.5, we need to use a real number (a FLOAT).

```SQL
SELECT 1, 2, 'this is a string', 1/2, 4/2, 5/2, 1/2., 1./2,
  1/CAST(2 AS FLOAT);
```

In [4]:
pd.read_sql_query(
"SELECT 1, 2, 'this is a string', 1/2, 4/2, 5/2, 1/2., 1./2, 1/CAST(2 AS FLOAT)", con)

   1  2 'this is a string'  1/2  4/2  5/2  1/2.  1./2  1/CAST(2 AS FLOAT)
0  1  2   this is a string    0    2    2   0.5   0.5                 0.5

SQL statements ignore white spaces and new lines, the statement is only processed when after it sees ';'

__Example:__ The following two statements produce the same table.

```SQL
SELECT 1, 2, 'this is a string', 1/2;
```

In [5]:
pd.read_sql_query(
"SELECT 1, 2, 'this is a string', 1/2", con)

   1  2 'this is a string'  1/2
0  1  2   this is a string    0

```SQL
SELECT 1, 
2, 
             'this is a string',   1/2;
```

In [6]:
pd.read_sql_query(
"SELECT 1, \
2, \
             'this is a string',   1/2", con)

   1  2 'this is a string'  1/2
0  1  2   this is a string    0

### SQL Functions

There are many functions in SQLite and each implementation of SQL have different functions. Here are some random functions in SQLite:  

| Function | Description |
|----------|-------------|
| __ABS(col)__ | Absolute value of numeric column |
| __LENGTH(col)__ | Return length of string column |
| __LOWER(col)__ | Return the string column in lower case |
| __UPPER(col)__ | Return the string column in upper case |
| __RANDOM()__ |	A pseudo-random integer between -9223372036854775808 and +9223372036854775807 |

```SQL
SELECT ABS(-8), LENGTH('This is a String'), LOWER('ThIS Is A StRiNg'),
  RANDOM();
```

In [7]:
pd.read_sql_query(
"SELECT ABS(-8), LENGTH('This is a String'), LOWER('ThIS Is A StRiNg'), RANDOM()", con)

,ABS(-8),LENGTH('This is a String'),LOWER('ThIS Is A StRiNg'),RANDOM()
0,8,16,this is a string,-3673931771925487956

There are many more [core functions](http://www.sqlite.org/lang_corefunc.html) within SQLite.

In [8]:
from IPython.display import HTML
HTML('<iframe src=http://www.sqlite.org/lang_corefunc.html width=1000 height=600></iframe>')

### Quiz: SELECT Clause

Calculate the average of 2 random numbers.

```SQL
SELECT (RANDOM() + RANDOM())/2.;
```

In [9]:
pd.read_sql_query(
"SELECT (RANDOM() + RANDOM())/2.", con)

   (RANDOM() + RANDOM())/2.
0              3.877799e+18

__Q:__ What is the upper and lower case for the string __'UPPER or lower'__?

```SQL
SELECT UPPER('UPPER or lower'), LOWER('UPPER or lower');
```

In [10]:
pd.read_sql_query(
"SELECT UPPER('UPPER or lower'), LOWER('UPPER or lower')", con)

  UPPER('UPPER or lower') LOWER('UPPER or lower')
0          UPPER OR LOWER          upper or lower

## FROM Clause

__FROM Clause:__ Specifies the table: either a persistant table, or a result set: a join of two or more tables or a subquery or some combination of the two. 
```SQL
SELECT col1, col2, ...
FROM table_name;
```

__Example:__ What are the names, type, times and locations for Stats Club?

```SQL
SELECT name, type, start_time, end_time, location 
FROM event;
```

In [11]:
pd.read_sql_query(
"SELECT name, type, start_time, end_time, location \
FROM event", con)

,name,type,start_time,end_time,location
0,Begining of Term,social,2015-01-28 19:00:00,2015-01-28 22:00:00,C & D
1,End of Term,social,None,None,None
2,Intro to Hadoop,educational,2015-03-25 14:30:00,2015-03-25 16:00:00,M3-3103
3,Intro to SQL,educational,2015-02-05 18:00:00,2015-02-05 19:30:00,MC-3003
4,Prof Talk: Machine Learning,educational,2015-03-03 15:00:00,2015-03-03 16:00:00,M3-2134
5,Prof Talk 2,educational,None,None,None
6,Intro to SQL: Basic Queries,educational,2015-03-09 18:00:00,2015-03-09 19:30:00,MC-3003
7,Intro to SQL: Advanced Queries,educational,2015-03-12 18:00:00,2015-03-12 19:30:00,MC-3003

### Quiz: FROM Clause

__Q:__ Who are the execs for Stats Club, and what are their positions, and emails?
- Projection of name, position, and email from the table exec

```SQL
SELECT name, position, email 
FROM exec;
```

In [12]:
pd.read_sql_query(
"SELECT name, position, email \
FROM exec", con)

                name        position                     email
0     Darrell Aucoin       President  darrell.aucoin@gmail.com
1  Judith B. Gibbons          Events       judith@uwaterloo.ca
2          Lamar Roy         Finance        lamar@uwaterloo.ca
3     Gilberto Cross          Events     gilberto@uwaterloo.ca
4         Melba Lane       President        melba@uwaterloo.ca
5         Ruben Lamb      Technology        ruben@uwaterloo.ca
6       Hannah Mason  Senior Advisor       hannah@uwaterloo.ca
7  Patrick Robertson          Events      patrick@uwaterloo.ca
8      Dominick Byrd          Events     dominick@uwaterloo.ca

## Aggregate Functions

__Aggregate Functions:__ Takes in the columns of a table and aggregates over the entries. 

| Function | Return value |
|----------|--------------|
| AVG(column) | Average of non-null values |
| COUNT(column) | Count of non-null values |
| MAX(column) | Maximum of values |
| MIN(column) | Minimum of values |
| SUM(column) | Sum of values |
| GROUP_CONCAT(column) | Concatenation of column strings |

- There are more aggregate functions for other implementations of SQL

More detailed descriptions of the aggregate functions within SQLite can be found [here](http://www.sqlite.org/lang_aggfunc.html).

```SQL
SELECT COUNT( 12 ), COUNT('ssdf'), COUNT(NULL), SUM(23), SUM(0), SUM(NULL), 
  AVG(0), AVG(NULL);
```

In [13]:
pd.read_sql_query(
"SELECT COUNT( 12 ), COUNT('ssdf'), COUNT(NULL), SUM(23), SUM(0), SUM(NULL), AVG(0), AVG(NULL)", con)

,COUNT( 12 ),COUNT('ssdf'),COUNT(NULL),SUM(23),SUM(0),SUM(NULL),AVG(0),AVG(NULL)
0,1,1,0,23,0,None,0,None

Lets work with some aggregate functions with the '`example`' table below:

In [14]:
pd.read_sql_query(
"SELECT * \
FROM example", con)

   number  floating        string
0       1     23.23          this
1    3232    -21.23            is
2      11     -2.00             a
3     -23     54.00        string
4       2       NaN  concatenated

```SQL
SELECT COUNT(*), COUNT(string), COUNT(floating), AVG(number), SUM(number),  
GROUP_CONCAT(string, ' ') 
FROM example;
```

In [15]:
pd.read_sql_query(
"SELECT COUNT(*), COUNT(string), COUNT(floating), AVG(number), SUM(number), GROUP_CONCAT(string, ' ') \
FROM example", con)

,COUNT(*),COUNT(string),COUNT(floating),AVG(number),SUM(number),"GROUP_CONCAT(string, ' ')"
0,5,5,4,644.6,3223,this is a string concatenated

### DISTINCT Prefix

In the SELECT clause we can specify to return only distinct tuples of columns
```SQL
SELECT DISTINCT col1, col2, ...
FROM table_name;
```
- We can also use DISTINCT within aggregate functions making them only aggregate over distinct entries
```SQL
SELECT aggregate_function(DISTINCT column_name)
FROM table_name;
```

__Example:__ What events have members attended?
- What are the distinct events where at least one member attended?

```SQL
SELECT DISTINCT event 
FROM attendance;
```

In [16]:
pd.read_sql_query(
"SELECT DISTINCT event \
FROM attendance", con)

                            event
0                    Intro to SQL
1                Begining of Term
2                     End of Term
3                 Intro to Hadoop
4     Intro to SQL: Basic Queries
5     Prof Talk: Machine Learning
6                     Prof Talk 2
7  Intro to SQL: Advanced Queries

### Quiz: DISTINCT

__Q:__ What are the __distinct__ majors of Stats Club members?

```SQL
SELECT DISTINCT major 
FROM member;
```

In [17]:
pd.read_sql_query(
"SELECT DISTINCT major \
FROM member", con)

          major
0         Stats
1     Pure Math
2            CS
3  Applied Math
4       Act Sci
5         C & O
6          Econ

__Q:__ How many __distinct__ majors of Stats Club members are there?

- DISTINCT can be within aggregate functions

```SQL
SELECT COUNT(DISTINCT major) 
FROM member;
```

In [18]:
pd.read_sql_query(
"SELECT COUNT(DISTINCT major) \
FROM member", con)

   COUNT(DISTINCT major)
0                      7

### Alias

#### Column Alias

To increase the readability of SQL as well as the result set, we can give columns new names:
```SQL
SELECT col AS new_name
FROM table_name;
```
- Column aliases make the final table more readiable and workiable for subqueries

__Example:__ If we give column aliases for the previous table, we make the result more interpretiable:

```SQL
SELECT COUNT(*) AS num_rows, COUNT(string) AS num_strings, 
  COUNT(floating) AS num_float, AVG(number) AS avg_integer, 
  SUM(number) AS sum_int, GROUP_CONCAT(string, ' ') AS cat_string 
FROM example;
```

In [19]:
pd.read_sql_query(
"SELECT COUNT(*) AS num_rows, COUNT(string) AS num_strings, \
COUNT(floating) AS num_float, AVG(number) AS avg_integer, \
SUM(number) AS sum_int, GROUP_CONCAT(string, ' ') AS cat_string \
FROM example", con)

,num_rows,num_strings,num_float,avg_integer,sum_int,cat_string
0,5,5,4,644.6,3223,this is a string concatenated

#### Table Alias

We can also give tables new names as well:
```SQL
SELECT table_alias_1.col_name, table_alias_2.col_name, ...
FROM table_1 AS table_alias_1, table_2 AS table_alias_2;
```
- Very useful when tables have common column names

__Note:__ We can reference what table a column is coming from by a '.'
```python
table_name.column_name
```

###  Quiz: Aliases

Perform a query using a table alias, and use this table alias when referencing the column i.e. `table_alias.column_name`
- This will be really important for bigger, more complicated queries

```SQL
SELECT e.name, e.start_time, e.location, e.Description 
FROM event AS e;
```

In [20]:
pd.read_sql_query(
"SELECT e.name, e.start_time, e.location, e.Description \
FROM event AS e", con)

,name,start_time,location,Description
0,Begining of Term,2015-01-28 19:00:00,C & D,Come and play games with your fellow stats Clu...
1,End of Term,None,None,End of Term social at a local Pub. A joint eve...
2,Intro to Hadoop,2015-03-25 14:30:00,M3-3103,Hadoop is a distributed computing system desig...
3,Intro to SQL,2015-02-05 18:00:00,MC-3003,SQL is a relational database language and alon...
4,Prof Talk: Machine Learning,2015-03-03 15:00:00,M3-2134,Machine Learning and Data Mining: How We can C...
5,Prof Talk 2,None,None,None
6,Intro to SQL: Basic Queries,2015-03-09 18:00:00,MC-3003,SQL is a relational database language and alon...
7,Intro to SQL: Advanced Queries,2015-03-12 18:00:00,MC-3003,SQL is a relational database language and alon...

## Selection (WHERE Clause)

__WHERE__ clauses filters the result set, removing rows where the condition returns either FALSE or NULL.

```SQL
SELECT col1, col2, ...
FROM table_name
WHERE condition;
```

__Example:__ What Stats Club events are social?

```SQL
SELECT *  
FROM event 
WHERE type = 'social';
```

In [21]:
pd.read_sql_query(
"SELECT * \
FROM event \
WHERE type = 'social'", con)

,name,type,presenter,organizer,poster,start_time,end_time,location,budget,Description
0,Begining of Term,social,None,judith,judith,2015-01-28 19:00:00,2015-01-28 22:00:00,C & D,90.0,Come and play games with your fellow stats Clu...
1,End of Term,social,None,dominick,dominick,None,None,None,160.0,End of Term social at a local Pub. A joint eve...

### Prediate Operators

| Operator | Description | Example |
|----------|-------------|---------|
| = | Equal to | WHERE gender = 'M' |
| <>, != | Not equal to | WHERE gender <> 'M' |
| > | Greater than | WHERE num > 5 |
| < | Less than | WHERE num < 5 |
| >= | Greater than or equal to | WHERE num >= 5 |
| <= | Less than or equal to | WHERE num <= 5 |
| IS NULL | Value is NULL | WHERE num IS NULL |
| IS NOT NULL | Value is not NULL | WHERE num IS NOT NULL |
| BETWEEN | Between a range | WHERE num BETWEEN 3 AND 5 |
| IN | In a list of values | WHERE num IN (3, 5, 8) |
| LIKE | Pattern Search | WHERE str LIKE 'F%' |
| EXISTS | Subquery have any rows? | WHERE EXISTS (subquery) |

#### LIKE Predicate

LIKE predicates 

'\_' means a character of any type  
'%' means between 0 or more characters of any type

__Example:__ What Stats Club members has a name begining with F?

```SQL
SELECT * 
FROM member 
WHERE name LIKE 'F%';
```

In [22]:
pd.read_sql_query(
"SELECT * \
FROM member \
WHERE name LIKE 'F%'", con)

,quest_id,name,email,faculty,major,paid,card
0,fred,Fred E. Finch,fred@uwaterloo.ca,Math,Pure Math,Y,Y
1,frances,Frances A. Miller,frances@uwaterloo.ca,Math,Stats,Y,Y

#### Operator Modifiers

##### ALL, ANY or SOME Operator Modifiers

The operators =, <>, !=, >, <, >=, <= can be used with a list of values and the operators `ALL` or `ANY / SOME`.  

- SQLite does __NOT__ have `ALL` or `ANY / SOME` implemented

__ANY, SOME__ Operator returns true, if operator is true for __any__ value in the set.  

$$E_{1}\vee E_{2}\vee E_{3}\vee\cdots\vee E_{n}$$

__ALL__ Operator returns true, if operator is true for __all__ values in the set.  

$$E_{1}\wedge E_{2}\wedge E_{3}\wedge\cdots\wedge E_{n}$$

```SQL
SELECT *
FROM table_name
WHERE column_name < ALL (subquery_returning_one_column);
```

__Example:__ What are the expenses for non-social events? (`ALL`, `ANY`, and `SOME` are not implmented in SQLite)

```SQL
SELECT * 
FROM expenses 
WHERE event != ALL (SELECT name 
                    FROM event
                    WHERE type = 'social');
```

In [23]:
pd.read_sql_query(
"SELECT * \
FROM expenses \
WHERE event NOT IN (SELECT name \
                    FROM event \
                    WHERE type = 'social')", con)

                             event  expense  price
0                     Intro to SQL    pizza  87.43
1                     Intro to SQL      pop  15.34
2                  Intro to Hadoop   coffee  23.12
3                  Intro to Hadoop    water  10.23
4                  Intro to Hadoop   donuts  53.23
5                  Intro to Hadoop  cookies  10.23
6      Intro to SQL: Basic Queries  cookies  10.23
7      Intro to SQL: Basic Queries   donuts  20.34
8      Intro to SQL: Basic Queries      pop  21.54
9      Intro to SQL: Basic Queries    water  10.52
10     Prof Talk: Machine Learning      pop  20.31
11     Prof Talk: Machine Learning    pizza  62.56
12                     Prof Talk 2    pizza  61.56
13                     Prof Talk 2      pop  15.65
14  Intro to SQL: Advanced Queries  cookies  10.23
15  Intro to SQL: Advanced Queries   donuts  20.34
16  Intro to SQL: Advanced Queries      pop  21.54
17  Intro to SQL: Advanced Queries    water  10.52

#### AND, OR Operators

A group of filter conditions can be linked together with AND or OR operators. 
```SQL
SELECT col1, col2, ...
FROM table_name
WHERE (condition1 AND condition2 ) OR condition3;
```

__Example:__ What Stats Club members has a name with it's second letter as A or ends in B?

```SQL
SELECT name
FROM member 
WHERE name LIKE '_a%' OR  name LIKE '%b';
```

In [24]:
pd.read_sql_query(
"SELECT name \
FROM member \
WHERE name LIKE '_a%' OR  name LIKE '%b'", con)

                  name
0       Darrell Aucoin
1     James M. Eddings
2        James A. Foxt
3      Daniel J. Moore
4     Nancy P. Jackson
5     Ralph L. Waldrop
6  Tameika M. McMaster
7     Janelle T. Smith
8           Ruben Lamb
9    Patrick Robertson

### Quiz: Filtering (WHERE Clause)

__Q:__ What events for Stats Club are introductory talks?
- Introductory talk names start with 'Intro'

```SQL
SELECT name
FROM event 
WHERE name LIKE 'Intro%';
```

In [25]:
pd.read_sql_query(
"SELECT name \
FROM event \
WHERE name LIKE 'Intro%'", con)

                             name
0                 Intro to Hadoop
1                    Intro to SQL
2  Intro to SQL: Advanced Queries
3     Intro to SQL: Basic Queries

__Q:__ What Stats Club members have their first name starting with a letter __BETWEEN__ A and G?

```SQL
SELECT name 
FROM member 
WHERE name BETWEEN 'A' AND 'G';
```

In [26]:
pd.read_sql_query(
"SELECT name \
FROM member \
WHERE name BETWEEN 'A' AND 'G'", con)

                   name
0        Darrell Aucoin
1         Fred E. Finch
2       Billy L. Hunter
3    Austin K. Gilliard
4         Elaine S. Ott
5       Daniel J. Moore
6     Frances A. Miller
7   Deborah D. Helfrich
8     Bobbie D. Mathews
9      Arnold J. Fuller
10    Ann W. McLaughlin
11        Dominick Byrd

## GROUP BY Clause
- GROUP BY clause groups the table by a column (or tuple of columns) and applies a function to each group
    - In the SELECT portion of the statement, you can only list the grouped column(s) and aggregate functions on them.  
![alt text](Images/Group By.png)

```SQL
SELECT col1, col2, ..., aggregate_function
FROM table_name
GROUP BY col1, col2, ...;
```

### Aggregate Functions
Recall:
__Aggregate Functions:__ Takes in the columns of a table and aggregates over the entries. 
- If we use a GROUP BY clause, the aggregation will be over those groups

| Function | Return value |
|----------|--------------|
| AVG(column) | Average of non-null values |
| COUNT(column) | Count of non-null values |
| MAX(column) | Maximum of values |
| MIN(column) | Minimum of values |
| SUM(column) | Sum of values |
| GROUP_CONCAT(column) | Concatenation of column strings |

- There are more aggregate functions for other implementations of SQL

__Example:__ What are the number of each type of event for Stats Club?

```SQL
SELECT type, COUNT(*) AS num_events 
FROM event 
GROUP BY type;
```

In [27]:
pd.read_sql_query(
"SELECT type, COUNT(*) AS num_events \
FROM event \
GROUP BY type", con)

          type  num_events
0  educational           6
1       social           2

### HAVING Clause
HAVING clauses are very similar to WHERE clauses but can have aggregate function in their conditions.

You can have a WHERE and HAVING clause in the same statement.

__Example:__ How many Stats Club members are in each major where the major has at least 2 members?

```SQL
SELECT faculty, major, COUNT(*) 
FROM member 
GROUP BY faculty, major 
HAVING COUNT(*) >= 2;
```

In [28]:
pd.read_sql_query(
"SELECT faculty, major, COUNT(*) \
FROM member \
GROUP BY faculty, major \
HAVING COUNT(*) >= 2", con)

  faculty         major  COUNT(*)
0    Math       Act Sci        10
1    Math  Applied Math         2
2    Math         C & O         2
3    Math            CS         3
4    Math     Pure Math         2
5    Math         Stats        14

### GROUP BY with ROLLUP / CUBE
The ROLLUP operator produces a result set where the aggregate function is applied to each level of the GROUP BY hierachy.
- The ROLLUP operator is __NOT__ implemented in SQLite
- Useful for making reports with totals and subtotals

```SQL
SELECT col1, col2, ..., aggregate_function
FROM table_name
GROUP BY col1, col2, ... WITH ROLLUP;
```

__Example:__ What are the number of Stats Club members in each faculty and major, including subtotals?

```SQL
SELECT faculty, major, COUNT(*) AS num_members
FROM member
GROUP BY faculty, major WITH ROLLUP;
```

In [29]:
pd.read_sql_query(
"SELECT faculty, major, num_members FROM (  \
SELECT '1' orderCol, faculty, major, COUNT(*) AS num_members FROM member GROUP BY faculty, major \
UNION \
SELECT '2' orderCol, faculty, NULL as major, COUNT(*) AS num_members FROM member \
GROUP BY faculty \
UNION \
SELECT '99' orderCol, NULL AS faculty, NULL AS major, COUNT(*) AS num_members FROM member) AS t1 \
ORDER BY CASE when orderCol='99' then 1 else 0 end, faculty, orderCol", con)

  faculty         major  num_members
0     Art          Econ            1
1     Art          None            1
2    Math       Act Sci           10
3    Math  Applied Math            2
4    Math         C & O            2
5    Math            CS            3
6    Math     Pure Math            2
7    Math         Stats           14
8    Math          None           33
9    None          None           34

Note that for Art and Math in faculty there is a row which has a NULL value. This is a total for those groups.  

There is also one row with NULL values for faculty and major, this is the grand total of all members.

### Quiz: Aggregation (GROUP BY Clause)
__Q:__ What is the attendance for each Stats Club event?

```SQL
SELECT event, COUNT(*) AS attendance 
FROM attendance 
GROUP BY event;
```

In [30]:
pd.read_sql_query(
"SELECT event, COUNT(*) AS attendance \
FROM attendance \
GROUP BY event", con)

                            event  attendance
0                Begining of Term          12
1                     End of Term          18
2                 Intro to Hadoop          17
3                    Intro to SQL          22
4  Intro to SQL: Advanced Queries          23
5     Intro to SQL: Basic Queries          23
6                     Prof Talk 2          16
7     Prof Talk: Machine Learning          20

## Joins
At times, we need information from multiple tables, to do this we need to join tables together. We can do this several ways:

1. __CROSS JOIN:__ The cartesian product of rows from each table.
2. __INNER JOIN:__ Join two tables on a join-predicate, losing rows when evaluated false/null.
3. __OUTER JOIN:__ Retains each record for the table(s) even when it has no matching rows from the other table. The returning table has null values for missing records.

    1. __LEFT OUTER JOIN:__ Keep each record for first table but not the table it's joining with.

    2. __RIGHT OUTER JOIN:__ Keep each record for second table but not the table it's joining with.

    3. __FULL OUTER JOIN:__ Keep all record for all tables.

4. __NATURAL JOIN:__ Tables with the exact same column name and datatype are joined along that column.

### CROSS JOIN
__CROSS JOIN__ is the cartesian product of two tables
```SQL
SELECT col1, col2, ...
FROM table1 CROSS JOIN table2;
```
- if table1 has n rows and table2 has m rows, then the result set has n * m rows  

We can also get a CROSS JOIN by listing the tables seperated by a ','
```SQL
SELECT col1, col2, ...
FROM table1, table2;
```

__Example:__ Suppose we are creating a games tourtament between Stats Club members where every member play every other member once. How can we create such a table?

```SQL
SELECT m1.name AS Player_1, m2.name  AS Player_2 
FROM member AS m1 CROSS JOIN member AS m2;
```

In [31]:
pd.read_sql_query(
"SELECT m1.name AS Player_1, m2.name  AS Player_2 \
FROM member AS m1 CROSS JOIN member AS m2", con)

               Player_1               Player_2
0        Darrell Aucoin         Darrell Aucoin
1        Darrell Aucoin          Fred E. Finch
2        Darrell Aucoin           Ryan T. Luby
3        Darrell Aucoin        Billy L. Hunter
4        Darrell Aucoin        John J. Oquendo
5        Darrell Aucoin  Stephanie R. Matthews
6        Darrell Aucoin     Robert B. Williams
7        Darrell Aucoin     Austin K. Gilliard
8        Darrell Aucoin       James M. Eddings
9        Darrell Aucoin          Elaine S. Ott
10       Darrell Aucoin          James A. Foxt
11       Darrell Aucoin        Daniel J. Moore
12       Darrell Aucoin      Kelly S. Ferguson
13       Darrell Aucoin         Joseph L. Wood
14       Darrell Aucoin       Vivian R. Donley
15       Darrell Aucoin      Frances A. Miller
16       Darrell Aucoin       Mina W. Lawrence
17       Darrell Aucoin  Phillip C. Mascarenas
18       Darrell Aucoin         Jeff M. Wright
19       Darrell Aucoin    Deborah D. Helfrich
20       Darrell Aucoin       Nancy P. Jackson
21       Darrell Aucoin      Bobbie D. Mathews
22       Darrell Aucoin       Arnold J. Fuller
23       Darrell Aucoin       Melvin O. Martin
24       Darrell Aucoin       Ralph L. Waldrop
25       Darrell Aucoin   Mildred F. Hottinger
26       Darrell Aucoin    Tameika M. McMaster
27       Darrell Aucoin    Melissa R. Anderson
28       Darrell Aucoin       Janelle T. Smith
29       Darrell Aucoin      Ann W. McLaughlin
...                 ...                    ...
1126  Patrick Robertson        John J. Oquendo
1127  Patrick Robertson  Stephanie R. Matthews
1128  Patrick Robertson     Robert B. Williams
1129  Patrick Robertson     Austin K. Gilliard
1130  Patrick Robertson       James M. Eddings
1131  Patrick Robertson          Elaine S. Ott
1132  Patrick Robertson          James A. Foxt
1133  Patrick Robertson        Daniel J. Moore
1134  Patrick Robertson      Kelly S. Ferguson
1135  Patrick Robertson         Joseph L. Wood
1136  Patrick Robertson       Vivian R. Donley
1137  Patrick Robertson      Frances A. Miller
1138  Patrick Robertson       Mina W. Lawrence
1139  Patrick Robertson  Phillip C. Mascarenas
1140  Patrick Robertson         Jeff M. Wright
1141  Patrick Robertson    Deborah D. Helfrich
1142  Patrick Robertson       Nancy P. Jackson
1143  Patrick Robertson      Bobbie D. Mathews
1144  Patrick Robertson       Arnold J. Fuller
1145  Patrick Robertson       Melvin O. Martin
1146  Patrick Robertson       Ralph L. Waldrop
1147  Patrick Robertson   Mildred F. Hottinger
1148  Patrick Robertson    Tameika M. McMaster
1149  Patrick Robertson    Melissa R. Anderson
1150  Patrick Robertson       Janelle T. Smith
1151  Patrick Robertson      Ann W. McLaughlin
1152  Patrick Robertson      Judith B. Gibbons
1153  Patrick Robertson             Ruben Lamb
1154  Patrick Robertson          Dominick Byrd
1155  Patrick Robertson      Patrick Robertson

[1156 rows x 2 columns]

However we have have players playing themselves, and rounds with  the same players in opposite roles. We just need to filter these out.

```SQL
SELECT m1.name AS Player_1, m2.name  AS Player_2 
FROM member AS m1 CROSS JOIN member AS m2 
WHERE m1.name > m2.name;
```

In [32]:
pd.read_sql_query(
"SELECT m1.name AS Player_1, m2.name  AS Player_2 \
FROM member AS m1 CROSS JOIN member AS m2 \
WHERE m1.name > m2.name", con)

              Player_1              Player_2
0       Darrell Aucoin       Billy L. Hunter
1       Darrell Aucoin    Austin K. Gilliard
2       Darrell Aucoin       Daniel J. Moore
3       Darrell Aucoin     Bobbie D. Mathews
4       Darrell Aucoin      Arnold J. Fuller
5       Darrell Aucoin     Ann W. McLaughlin
6        Fred E. Finch        Darrell Aucoin
7        Fred E. Finch       Billy L. Hunter
8        Fred E. Finch    Austin K. Gilliard
9        Fred E. Finch         Elaine S. Ott
10       Fred E. Finch       Daniel J. Moore
11       Fred E. Finch     Frances A. Miller
12       Fred E. Finch   Deborah D. Helfrich
13       Fred E. Finch     Bobbie D. Mathews
14       Fred E. Finch      Arnold J. Fuller
15       Fred E. Finch     Ann W. McLaughlin
16       Fred E. Finch         Dominick Byrd
17        Ryan T. Luby        Darrell Aucoin
18        Ryan T. Luby         Fred E. Finch
19        Ryan T. Luby       Billy L. Hunter
20        Ryan T. Luby       John J. Oquendo
21        Ryan T. Luby    Robert B. Williams
22        Ryan T. Luby    Austin K. Gilliard
23        Ryan T. Luby      James M. Eddings
24        Ryan T. Luby         Elaine S. Ott
25        Ryan T. Luby         James A. Foxt
26        Ryan T. Luby       Daniel J. Moore
27        Ryan T. Luby     Kelly S. Ferguson
28        Ryan T. Luby        Joseph L. Wood
29        Ryan T. Luby     Frances A. Miller
..                 ...                   ...
531      Dominick Byrd       Daniel J. Moore
532      Dominick Byrd   Deborah D. Helfrich
533      Dominick Byrd     Bobbie D. Mathews
534      Dominick Byrd      Arnold J. Fuller
535      Dominick Byrd     Ann W. McLaughlin
536  Patrick Robertson        Darrell Aucoin
537  Patrick Robertson         Fred E. Finch
538  Patrick Robertson       Billy L. Hunter
539  Patrick Robertson       John J. Oquendo
540  Patrick Robertson    Austin K. Gilliard
541  Patrick Robertson      James M. Eddings
542  Patrick Robertson         Elaine S. Ott
543  Patrick Robertson         James A. Foxt
544  Patrick Robertson       Daniel J. Moore
545  Patrick Robertson     Kelly S. Ferguson
546  Patrick Robertson        Joseph L. Wood
547  Patrick Robertson     Frances A. Miller
548  Patrick Robertson      Mina W. Lawrence
549  Patrick Robertson        Jeff M. Wright
550  Patrick Robertson   Deborah D. Helfrich
551  Patrick Robertson      Nancy P. Jackson
552  Patrick Robertson     Bobbie D. Mathews
553  Patrick Robertson      Arnold J. Fuller
554  Patrick Robertson      Melvin O. Martin
555  Patrick Robertson  Mildred F. Hottinger
556  Patrick Robertson   Melissa R. Anderson
557  Patrick Robertson      Janelle T. Smith
558  Patrick Robertson     Ann W. McLaughlin
559  Patrick Robertson     Judith B. Gibbons
560  Patrick Robertson         Dominick Byrd

[561 rows x 2 columns]

### INNER JOIN
__INNER JOIN__ Joins two tables where the join condition returns true. Discarded when returning false or NULL.
```SQL
SELECT col1, col2, ...
FROM table1 INNER JOIN table2 ON condition;
```

#### ON Clause
The __ON__ clause specifies the join condition:

- The ON clause can use a multiple set of conditions connected by AND, OR

- USING(<join col>) can also be used if both tables have the same column name and type

- Some SQL implementations constructs the ON clause from the WHERE clause (DB2)
    - filtering by the WHERE clause gives the same result but in some implementations will product an intermediate cross product of tables (making the query slower)

__Example:__ Note that in the previous example with CROSS JOIN where we made a tournament player list using the WHERE clause, we can get the same table by using an INNER JOIN and Θ='>'.

```SQL
SELECT m1.name AS Player_1, m2.name  AS Player_2 
FROM member AS m1 INNER JOIN member AS m2 ON m1.name > m2.name;
```

In [33]:
pd.read_sql_query(
"SELECT m1.name AS Player_1, m2.name  AS Player_2 \
FROM member AS m1 INNER JOIN member AS m2 ON m1.name > m2.name", con)

              Player_1              Player_2
0       Darrell Aucoin       Billy L. Hunter
1       Darrell Aucoin    Austin K. Gilliard
2       Darrell Aucoin       Daniel J. Moore
3       Darrell Aucoin     Bobbie D. Mathews
4       Darrell Aucoin      Arnold J. Fuller
5       Darrell Aucoin     Ann W. McLaughlin
6        Fred E. Finch        Darrell Aucoin
7        Fred E. Finch       Billy L. Hunter
8        Fred E. Finch    Austin K. Gilliard
9        Fred E. Finch         Elaine S. Ott
10       Fred E. Finch       Daniel J. Moore
11       Fred E. Finch     Frances A. Miller
12       Fred E. Finch   Deborah D. Helfrich
13       Fred E. Finch     Bobbie D. Mathews
14       Fred E. Finch      Arnold J. Fuller
15       Fred E. Finch     Ann W. McLaughlin
16       Fred E. Finch         Dominick Byrd
17        Ryan T. Luby        Darrell Aucoin
18        Ryan T. Luby         Fred E. Finch
19        Ryan T. Luby       Billy L. Hunter
20        Ryan T. Luby       John J. Oquendo
21        Ryan T. Luby    Robert B. Williams
22        Ryan T. Luby    Austin K. Gilliard
23        Ryan T. Luby      James M. Eddings
24        Ryan T. Luby         Elaine S. Ott
25        Ryan T. Luby         James A. Foxt
26        Ryan T. Luby       Daniel J. Moore
27        Ryan T. Luby     Kelly S. Ferguson
28        Ryan T. Luby        Joseph L. Wood
29        Ryan T. Luby     Frances A. Miller
..                 ...                   ...
531      Dominick Byrd       Daniel J. Moore
532      Dominick Byrd   Deborah D. Helfrich
533      Dominick Byrd     Bobbie D. Mathews
534      Dominick Byrd      Arnold J. Fuller
535      Dominick Byrd     Ann W. McLaughlin
536  Patrick Robertson        Darrell Aucoin
537  Patrick Robertson         Fred E. Finch
538  Patrick Robertson       Billy L. Hunter
539  Patrick Robertson       John J. Oquendo
540  Patrick Robertson    Austin K. Gilliard
541  Patrick Robertson      James M. Eddings
542  Patrick Robertson         Elaine S. Ott
543  Patrick Robertson         James A. Foxt
544  Patrick Robertson       Daniel J. Moore
545  Patrick Robertson     Kelly S. Ferguson
546  Patrick Robertson        Joseph L. Wood
547  Patrick Robertson     Frances A. Miller
548  Patrick Robertson      Mina W. Lawrence
549  Patrick Robertson        Jeff M. Wright
550  Patrick Robertson   Deborah D. Helfrich
551  Patrick Robertson      Nancy P. Jackson
552  Patrick Robertson     Bobbie D. Mathews
553  Patrick Robertson      Arnold J. Fuller
554  Patrick Robertson      Melvin O. Martin
555  Patrick Robertson  Mildred F. Hottinger
556  Patrick Robertson   Melissa R. Anderson
557  Patrick Robertson      Janelle T. Smith
558  Patrick Robertson     Ann W. McLaughlin
559  Patrick Robertson     Judith B. Gibbons
560  Patrick Robertson         Dominick Byrd

[561 rows x 2 columns]

__Note:__ `CROSS JOIN` is rarely used in practice as `INNER JOIN` is more efficient and usually the same `WHERE` condition can be applied to the ON clause.

__Example:__ How many events does each member attend?

- Note that this query does not include members who attended no events
    - Query is ordered by events_attended to show a comparison with a latter query

```SQL
SELECT m.name, COUNT(a.event) AS events_attended 
FROM member AS m INNER JOIN attendance AS a ON m.quest_id = a.member
GROUP BY m.name
ORDER BY events_attended;
```

In [34]:
pd.read_sql_query(
"SELECT m.name, COUNT(a.event) AS events_attended \
FROM member AS m INNER JOIN attendance AS a ON m.quest_id = a.member \
GROUP BY m.name \
ORDER BY events_attended", con)

                     name  events_attended
0         John J. Oquendo                1
1     Melissa R. Anderson                2
2        Melvin O. Martin                2
3        Mina W. Lawrence                2
4       Ann W. McLaughlin                3
5       Bobbie D. Mathews                3
6        James M. Eddings                3
7      Austin K. Gilliard                4
8        Janelle T. Smith                4
9          Jeff M. Wright                4
10   Mildred F. Hottinger                4
11  Phillip C. Mascarenas                4
12           Ryan T. Luby                4
13       Vivian R. Donley                4
14       Arnold J. Fuller                5
15          Dominick Byrd                5
16      Kelly S. Ferguson                5
17       Nancy P. Jackson                5
18       Ralph L. Waldrop                5
19             Ruben Lamb                5
20        Billy L. Hunter                6
21    Deborah D. Helfrich                6
22      Frances A. Miller                6
23          Fred E. Finch                6
24         Joseph L. Wood                6
25      Judith B. Gibbons                6
26     Robert B. Williams                6
27  Stephanie R. Matthews                6
28    Tameika M. McMaster                6
29          Elaine S. Ott                7
30        Daniel J. Moore                8
31      Patrick Robertson                8

### OUTER JOIN
__OUTER JOIN__ A join that returns all rows for 1 or 2 tables, even when there is no corresponding value. In these cases, NULL values are entered for these corresponding rows.

There are 3 types of OUTER JOINs:

1. __LEFT OUTER JOIN__: An OUTER JOIN returning all rows of the table first mentioned.

2. __RIGHT OUTER JOIN__: An OUTER JOIN returning all rows of the table second mentioned.

3. __FULL OUTER JOIN__: An OUTER JOIN returning all rows of both tables.  


- Only LEFT OUTER JOIN is implemented in SQLite

__Example:__ What are the names of Stat Club members and how many events they attended?

```SQL
SELECT m.name, COUNT(a.event) AS events_attended 
FROM member AS m LEFT OUTER JOIN attendance AS a ON m.quest_id = a.member
GROUP BY m.name
ORDER BY events_attended;
```

In [35]:
pd.read_sql_query(
"SELECT m.name, COUNT(a.event) AS events_attended \
FROM member AS m LEFT OUTER JOIN attendance AS a ON m.quest_id = a.member \
GROUP BY m.name \
ORDER BY events_attended", con)

                     name  events_attended
0          Darrell Aucoin                0
1           James A. Foxt                0
2         John J. Oquendo                1
3     Melissa R. Anderson                2
4        Melvin O. Martin                2
5        Mina W. Lawrence                2
6       Ann W. McLaughlin                3
7       Bobbie D. Mathews                3
8        James M. Eddings                3
9      Austin K. Gilliard                4
10       Janelle T. Smith                4
11         Jeff M. Wright                4
12   Mildred F. Hottinger                4
13  Phillip C. Mascarenas                4
14           Ryan T. Luby                4
15       Vivian R. Donley                4
16       Arnold J. Fuller                5
17          Dominick Byrd                5
18      Kelly S. Ferguson                5
19       Nancy P. Jackson                5
20       Ralph L. Waldrop                5
21             Ruben Lamb                5
22        Billy L. Hunter                6
23    Deborah D. Helfrich                6
24      Frances A. Miller                6
25          Fred E. Finch                6
26         Joseph L. Wood                6
27      Judith B. Gibbons                6
28     Robert B. Williams                6
29  Stephanie R. Matthews                6
30    Tameika M. McMaster                6
31          Elaine S. Ott                7
32        Daniel J. Moore                8
33      Patrick Robertson                8

### Natural Join
__NATURAL JOIN__ A join condition that lets the server decide on the join conditions based on the same column names and types across columns for the tables.

__Example:__ What are the position and duties of each Stats Club exec?

```SQL
SELECT  e.name, e.position, ep.duties 
FROM exec AS e NATURAL JOIN exec_position AS ep;
```

In [36]:
pd.read_sql_query(
"SELECT  e.name, e.position, ep.duties \
FROM exec AS e NATURAL JOIN exec_position AS ep", con)

,name,position,duties
0,Darrell Aucoin,President,To be aware of MathSoc's Policies and Bylaws i...
1,Darrell Aucoin,President,To call and preside over general meetings.
2,Darrell Aucoin,President,To manage the executive team and the strategic...
3,Darrell Aucoin,President,"To post announcements of all club meetings, an..."
4,Judith B. Gibbons,Events,To assist the president and other vice-preside...
5,Judith B. Gibbons,Events,To chair the organization and promotion of lea...
6,Lamar Roy,Finance,To ensure membership fees are collected and ma...
7,Lamar Roy,Finance,To keep an up-to-date record of financial tran...
8,Lamar Roy,Finance,To prepare a summary of the financial records ...
9,Lamar Roy,Finance,To prepare the budget at the beginning of term.
10,Lamar Roy,Finance,To volunteer as president in the absence of th...
11,Gilberto Cross,Events,To assist the president and other vice-preside...
12,Gilberto Cross,Events,To chair the organization and promotion of lea...
13,Melba Lane,President,To be aware of MathSoc's Policies and Bylaws i...
14,Melba Lane,President,To call and preside over general meetings.
15,Melba Lane,President,To manage the executive team and the strategic...
16,Melba Lane,President,"To post announcements of all club meetings, an..."
17,Ruben Lamb,Technology,Maintain and update the club website.
18,Ruben Lamb,Technology,"Maintain any hardware, software, or technology..."
19,Ruben Lamb,Technology,Perform the duties of a Vice President - Event...
20,Hannah Mason,Senior Advisor,Have previous club management experience in or...
21,Hannah Mason,Senior Advisor,To be aware of MathSoc's Policies and Bylaws i...
22,Patrick Robertson,Events,To assist the president and other vice-preside...
23,Patrick Robertson,Events,To chair the organization and promotion of lea...
24,Dominick Byrd,Events,To assist the president and other vice-preside...
25,Dominick Byrd,Events,To chair the organization and promotion of lea...

### Quiz: Joining Tables

__Q:__ What are the email addresses and phone numbers of stats club execs who are in change or organizing at least one event?
![alt text](Images/StatClubTables2.png)

```SQL
SELECT DISTINCT exec.name, exec.email, exec.phone 
FROM exec INNER JOIN event ON exec.questid = event.organizer;
```

In [37]:
pd.read_sql_query(
"SELECT DISTINCT exec.name, exec.email, exec.phone \
FROM exec INNER JOIN event ON exec.questid = event.organizer", con)

                name                     email         phone
0  Judith B. Gibbons       judith@uwaterloo.ca  519-555-2343
1      Dominick Byrd     dominick@uwaterloo.ca  519-555-2325
2     Darrell Aucoin  darrell.aucoin@gmail.com  519-555-1424
3  Patrick Robertson      patrick@uwaterloo.ca  519-555-2312

## Subqueries
Subqueries are queries contained in queries. These subqueries are contained in '(', ')'

There are two types of subqueries:

1. __Non-Correlated Subqueries:__ Can be run independently of the larger query.

2. __Correlated Subqueries:__ Must be run concurrently with the outer query. They are dependent on the outer query.

### Non-Correlated Subqueries
__Non-Correlated Subquery:__ Any valid query within query that if executed by itself will produce a result (including empty set). These are enclosed in '(', ')' in __FROM__, __WHERE__, or __HAVING__ clauses.

__Example:__ What Stats Club execs are in charge of making posters?

```SQL
SELECT e.name, e.position 
FROM exec AS e 
WHERE e.questid IN (SELECT poster FROM event);
```

In [38]:
pd.read_sql_query(
"SELECT e.name, e.position \
FROM exec AS e \
WHERE e.questid IN (SELECT poster FROM event)", con)

                name   position
0     Darrell Aucoin  President
1      Dominick Byrd     Events
2     Gilberto Cross     Events
3  Judith B. Gibbons     Events
4  Patrick Robertson     Events

### Correlated Subqueries
__Correlated  Subquery__ makes references to it's containing query, executing it for every candidate row referenced.
- Correlated subqueries can appear in the __SELECT__, __WHERE__, or __HAVING__ clauses.

__Example:__ What majors are the current Stats Club execs enrolled in?
- The member table has the information on majors but exec has the information on execs

```SQL
SELECT name, position, 
(SELECT faculty FROM member AS m WHERE m.quest_id = e.questid) AS faulty, 
(SELECT major FROM member AS m WHERE m.quest_id = e.questid) AS major 
FROM exec AS e;
```

In [39]:
pd.read_sql_query(
"SELECT name, position, \
(SELECT faculty FROM member AS m WHERE m.quest_id = e.questid) AS faulty, \
(SELECT major FROM member AS m WHERE m.quest_id = e.questid) AS major \
FROM exec AS e", con)

                name        position faulty      major
0     Darrell Aucoin       President   Math      Stats
1  Judith B. Gibbons          Events   Math    Act Sci
2          Lamar Roy         Finance   None       None
3     Gilberto Cross          Events   None       None
4         Melba Lane       President   None       None
5         Ruben Lamb      Technology   Math    Act Sci
6       Hannah Mason  Senior Advisor   None       None
7  Patrick Robertson          Events   Math      Stats
8      Dominick Byrd          Events   Math  Pure Math

### Correlated vs Non-Correlated
1. Correlated subquery is __dependent__ on outer query, non-correlated is __independent__.

2. Correlated subquery is executed __concurrently__ with outer query, non-correlated is executed before.

3. In general, for speed of execution:
$$\mbox{Correlated subquery}\prec\mbox{Non-Correlated subquery}\prec\mbox{Joins}$$

### Quiz: Subqueries
__Q:__ Where can a _Non-Correlated_ subquery can be placed?

__A:__ in the __FROM__, __WHERE__, and __HAVING__ clauses

__Q:__ Where can a _Correlated_ subquery can be placed?

__A:__ in the __SELECT__, __WHERE__, and __HAVING__ clauses

__Q:__ Using a non-correlated subquery, what are the names, locations, and descriptions of events that served pizza?
1. Break the problem into smaller pieces: What are the events that served pizza?
2. Only retrieve values from the table `event` that `event.name` matches those values

```SQL
SELECT event 
FROM expenses 
WHERE expense = 'pizza';
```

In [40]:
pd.read_sql_query(
"SELECT event \
FROM expenses \
WHERE expense = 'pizza'", con)

                         event
0             Begining of Term
1                 Intro to SQL
2                  Prof Talk 2
3  Prof Talk: Machine Learning

- Second, only retrieve values from the table `event` that `event.name` matches those values

```SQL
SELECT name, location, description 
FROM event 
WHERE name IN (SELECT event FROM expenses WHERE expense = 'pizza');
```

In [41]:
pd.read_sql_query(
"SELECT name, location, description \
FROM event  \
WHERE name IN (SELECT event FROM expenses WHERE expense = 'pizza')", con)

,name,location,Description
0,Begining of Term,C & D,Come and play games with your fellow stats Clu...
1,Intro to SQL,MC-3003,SQL is a relational database language and alon...
2,Prof Talk 2,None,None
3,Prof Talk: Machine Learning,M3-2134,Machine Learning and Data Mining: How We can C...

Or alternatively, using a join:

```SQL
SELECT e.name, e.location, e.description 
FROM (SELECT event FROM expenses WHERE expense = 'pizza') AS exp INNER JOIN event AS e 
  ON exp.event = e.name;
```

In [42]:
pd.read_sql_query(
"SELECT e.name, e.location, e.description \
FROM (SELECT event FROM expenses WHERE expense = 'pizza') AS exp INNER JOIN event AS e \
  ON exp.event = e.name", con)

,e.name,e.location,e.description
0,Begining of Term,C & D,Come and play games with your fellow stats Clu...
1,Intro to SQL,MC-3003,SQL is a relational database language and alon...
2,Prof Talk 2,None,None
3,Prof Talk: Machine Learning,M3-2134,Machine Learning and Data Mining: How We can C...

## Set Operations
Set operations create a combination of rows from 2 tables into one result set.
- The tables (or the projection of those tables) have to have the same number of columns and datatypes
    - if one column appears in a table but not in another, supply the value NULL for the missing column

1. __UNION__: For tables A and B, combines the rows for A and B into one result set.
2. __INTERSECT__: For tables A and B, returns the rows for A and B that they have in common.
3. __Difference (EXCEPT)__: For tables A and B, return only the rows in A that are not in common with B.

### UNION
__UNION operator:__ Addition of one result set to another result set with the same number of attributes and types.
```SQL
SELECT ... FROM ... 
UNION [ALL]
SELECT ... FROM ...
```
- Just __UNION__ removes duplicates, while __UNION ALL__ keeps all rows from both result sets.
![alt text](Images/Union.png)

![alt text](Images/Union_all.png)

__Example:__ Suppose are you need to contact everyone involved in Stats Club: members and execs.  
What are the names, email addresses, and phone numbers (if you have them) of all Stats Club members and execs?

```SQL
SELECT name, email, NULL AS phone 
FROM member 
UNION 
SELECT name, email, phone 
FROM exec;
```

In [43]:
pd.read_sql_query(
"SELECT name, email, NULL AS phone \
FROM member \
UNION \
SELECT name, email, phone \
FROM exec", con)

                     name                     email         phone
0       Ann W. McLaughlin          ann@uwaterloo.ca          None
1        Arnold J. Fuller       arnold@uwaterloo.ca          None
2      Austin K. Gilliard       austin@uwaterloo.ca          None
3         Billy L. Hunter        billy@uwaterloo.ca          None
4       Bobbie D. Mathews       bobbie@uwaterloo.ca          None
5         Daniel J. Moore       daniel@uwaterloo.ca          None
6          Darrell Aucoin  darrell.aucoin@gmail.com          None
7          Darrell Aucoin  darrell.aucoin@gmail.com  519-555-1424
8     Deborah D. Helfrich      deborah@uwaterloo.ca          None
9           Dominick Byrd     dominick@uwaterloo.ca          None
10          Dominick Byrd     dominick@uwaterloo.ca  519-555-2325
11          Elaine S. Ott       elaine@uwaterloo.ca          None
12      Frances A. Miller      frances@uwaterloo.ca          None
13          Fred E. Finch         fred@uwaterloo.ca          None
14         Gilberto Cross     gilberto@uwaterloo.ca  519-555-3453
15           Hannah Mason       hannah@uwaterloo.ca  519-555-2342
16          James A. Foxt    james.fox@uwaterloo.ca          None
17       James M. Eddings        james@uwaterloo.ca          None
18       Janelle T. Smith      janelle@uwaterloo.ca          None
19         Jeff M. Wright         jeff@uwaterloo.ca          None
20        John J. Oquendo         john@uwaterloo.ca          None
21         Joseph L. Wood       joseph@uwaterloo.ca          None
22      Judith B. Gibbons       judith@uwaterloo.ca          None
23      Judith B. Gibbons       judith@uwaterloo.ca  519-555-2343
24      Kelly S. Ferguson        kelly@uwaterloo.ca          None
25              Lamar Roy        lamar@uwaterloo.ca  519-555-3432
26             Melba Lane        melba@uwaterloo.ca  519-555-2322
27    Melissa R. Anderson      melissa@uwaterloo.ca          None
28       Melvin O. Martin       melvin@uwaterloo.ca          None
29   Mildred F. Hottinger      mildred@uwaterloo.ca          None
30       Mina W. Lawrence         mina@uwaterloo.ca          None
31       Nancy P. Jackson        nancy@uwaterloo.ca          None
32      Patrick Robertson      patrick@uwaterloo.ca          None
33      Patrick Robertson      patrick@uwaterloo.ca  519-555-2312
34  Phillip C. Mascarenas      phillip@uwaterloo.ca          None
35       Ralph L. Waldrop        ralph@uwaterloo.ca          None
36     Robert B. Williams       robert@uwaterloo.ca          None
37             Ruben Lamb        ruben@uwaterloo.ca          None
38             Ruben Lamb        ruben@uwaterloo.ca  519-555-5232
39           Ryan T. Luby         ryan@uwaterloo.ca          None
40  Stephanie R. Matthews         step@uwaterloo.ca          None
41    Tameika M. McMaster      tameika@uwaterloo.ca          None
42       Vivian R. Donley       vivian@uwaterloo.ca          None

### Intersection (INTERSECT Operator)
__INTERSECT operator:__ Returns only tuples that are in common between two result sets. Result sets must be equal in number and type of attributes.
```SQL
SELECT ... FROM ...
INTERSECT
SELECT ... FROM ...;
```
![alt text](Images/Intersect.png)

__Example:__ What Stats Club execs have also signed up as Stats Club members?

```SQL
SELECT name, quest_id 
FROM member 
INTERSECT 
SELECT name, questid 
FROM exec;
```

In [44]:
pd.read_sql_query(
"SELECT name, quest_id \
FROM member \
INTERSECT \
SELECT name, questid \
FROM exec", con)

                name  quest_id
0     Darrell Aucoin   darrell
1      Dominick Byrd  dominick
2  Judith B. Gibbons    judith
3  Patrick Robertson   patrick
4         Ruben Lamb     ruben

### Difference (EXCEPT Operator)
__EXCEPT operator:__ Returns the first result set minus anything it has in common with the second result set.
```SQL
SELECT ... FROM ...
EXCEPT [ALL]
SELECT ... FROM ...
```
- Just EXCEPT uses set theory version of minus. 

    - If B has a row in common with A then all rows matching that row is removed
![alt text](Images/Except.png)

- The optional ALL uses the bag semantics version.
    - If B has a row in common with A then only the number of common rows in B rows matching that row is removed
![alt text](Images/Except_all.png)

__Example:__ What Stats Club members are not execs?

```SQL
SELECT name, quest_id 
FROM member 
EXCEPT 
SELECT name, questid 
FROM exec;
```

In [45]:
pd.read_sql_query(
"SELECT name, quest_id \
FROM member \
EXCEPT \
SELECT name, questid \
FROM exec", con)

                     name   quest_id
0       Ann W. McLaughlin        ann
1        Arnold J. Fuller     arnold
2      Austin K. Gilliard     austin
3         Billy L. Hunter      billy
4       Bobbie D. Mathews     bobbie
5         Daniel J. Moore     daniel
6     Deborah D. Helfrich    deborah
7           Elaine S. Ott     elaine
8       Frances A. Miller    frances
9           Fred E. Finch       fred
10          James A. Foxt  james.fox
11       James M. Eddings      james
12       Janelle T. Smith    janelle
13         Jeff M. Wright       jeff
14        John J. Oquendo       john
15         Joseph L. Wood     joseph
16      Kelly S. Ferguson      kelly
17    Melissa R. Anderson    melissa
18       Melvin O. Martin     melvin
19   Mildred F. Hottinger    mildred
20       Mina W. Lawrence       mina
21       Nancy P. Jackson      nancy
22  Phillip C. Mascarenas    phillip
23       Ralph L. Waldrop      ralph
24     Robert B. Williams     robert
25           Ryan T. Luby       ryan
26  Stephanie R. Matthews       step
27    Tameika M. McMaster    tameika
28       Vivian R. Donley     vivian

## WITH Clause
__WITH clause:__ Makes a non-correlated subquery look like a table in the executed statement:

- Increases readability of the query as well as ensure that if it is used in several different places, it will only be executed once  

```SQL
WITH subquery_name [(colname1, ...)] AS
	(SELECT ...),
	subquery_name2 [(colname1, ...)] AS
	(SELECT ...)
SELECT ... 
```

__Example:__ Suppose you are doing a report for MathSoc detailing Stats Club events, budget, and expenses.

```SQL
WITH cost (event, expenses) AS 
    (SELECT event, SUM(price) 
    FROM expenses 
    GROUP BY event) 
SELECT e.name, e.type, e.budget, cost.expenses 
FROM event AS e INNER JOIN cost ON e.name = cost.event;
```

In [46]:
pd.read_sql_query(
"WITH cost (event, expenses) AS \
    (SELECT event, SUM(price) \
    FROM expenses \
    GROUP BY event) \
SELECT e.name, e.type, e.budget, cost.expenses \
FROM event AS e INNER JOIN cost ON e.name = cost.event", con)

                             name         type budget  expenses
0                Begining of Term       social   90.0     58.57
1                     End of Term       social  160.0    160.65
2                 Intro to Hadoop  educational   90.0     96.81
3                    Intro to SQL  educational   90.0    102.77
4  Intro to SQL: Advanced Queries  educational  100.0     62.63
5     Intro to SQL: Basic Queries  educational  100.0     62.63
6                     Prof Talk 2  educational   90.0     77.21
7     Prof Talk: Machine Learning  educational   90.0     82.87

### Quiz: WITH Clause (HARD)
__Q:__ MathSoc only provides a maximum cap on social events based on the formula below. What is the max cap for social expenses and is Stats Club over this limit?  
- Membership fee for Stats Club is 2 dollars

$$\begin{aligned}\mbox{Social expenses} & = & \max\left\{ 250,\left(\mbox{MathSoc Members}\right)\times\left(5+\left(\mbox{Member fee}\right)\right)\right\} \\
 & = & \max\left\{ 250,\left(\mbox{MathSoc Members}\right)\times7\right\} 
\end{aligned}$$  

Break the problem into smaller problems:
- What are the total expenses for social events?
- What is the max budget for social events?

Smaller Problems:
- What are the total expenses for social events?
    - What events are social events?

- What is the max cap for social events?
    - What is the result of the formula
    $$\left(\mbox{MathSoc Members}\right)\times7$$
        - What are the number of Stats Club members who are in the Math Faculty (aka MathSoc members)?
    - How do we find the max value between this number and 250?  
    
### Think about how to solve this for 5 mins

For total social expenses, we need to find the sum of expenses filtering out non-social expenses.  
__Part 1:__ What events are social?

```SQL
SELECT name 
FROM event 
WHERE type = 'social';
```

In [47]:
pd.read_sql_query(
"SELECT name \
FROM event \
WHERE type = 'social'", con)

               name
0  Begining of Term
1       End of Term

__Part 2:__ What are the total social expenses?

```SQL
SELECT SUM(price) 
FROM expenses 
WHERE event IN (SELECT name FROM event WHERE type = 'social');
```

In [48]:
pd.read_sql_query(
"SELECT SUM(price) \
FROM expenses \
WHERE event IN (SELECT name FROM event WHERE type = 'social')", con)

   SUM(price)
0      219.22

Or alternatively, we can join tables event and expenses and filter out non-social events:

```SQL
SELECT SUM(exp.price) 
FROM event AS e INNER JOIN expenses AS exp 
  ON e.name = exp.event 
WHERE e.type = 'social';
```

In [49]:
pd.read_sql_query(
"SELECT SUM(exp.price) \
FROM event AS e INNER JOIN expenses AS exp \
  ON e.name = exp.event \
WHERE e.type = 'social'", con)

   SUM(exp.price)
0          219.22

At this point we have one half of the problem solved, the final result would look a bit like:
```SQL
WITH soc_cost (expense) AS 
    (SELECT SUM(exp.price) 
     FROM event AS e INNER JOIN expenses AS exp 
       ON e.name = exp.event 
     WHERE type = 'social'),
soc_budget (budget) AS
     (SELECT statement)
SELECT statement;
```

__Part 3:__ We need to calculate the formula
$$\left(\mbox{MathSoc Members}\right)\times7$$
- First, what is the number of MathSoc Members (aka number of members who are in the Math Faculty)?

```SQL
SELECT COUNT(*) 
FROM member 
WHERE faculty = 'Math';
```

In [50]:
pd.read_sql_query(
"SELECT COUNT(*) \
FROM member \
WHERE faculty = 'Math'", con)

   COUNT(*)
0        33

__Part 4:__ What is the result of the formula  
$$\left(\mbox{MathSoc Members}\right)\times7$$

```SQL
SELECT COUNT(*) * 7 
FROM member 
WHERE faculty = 'Math';
```

In [51]:
pd.read_sql_query(
"SELECT COUNT(*) * 7 \
FROM member \
WHERE faculty = 'Math'", con)

   COUNT(*) * 7
0           231

__Part 5:__ What is the max of this number and 250?

```SQL
SELECT MAX(COUNT(*) * 7, 250) 
FROM member 
WHERE faculty = 'Math';
```

In [52]:
pd.read_sql_query(
"SELECT MAX(COUNT(*) * 7, 250) \
FROM member \
WHERE faculty = 'Math' ", con)

   MAX(COUNT(*) * 7, 250)
0                     250

Joining all of this up together:

```SQL
WITH soc_cost (expense) AS 
    (SELECT SUM(exp.price) 
     FROM event AS e INNER JOIN expenses AS exp 
       ON e.name = exp.event 
     WHERE e.type = 'social'),
soc_budget (budget) AS 
    (SELECT MAX(COUNT(*) * 7, 250) 
     FROM member 
     WHERE faculty = 'Math')
SELECT expense, budget, budget - expense
FROM soc_cost CROSS JOIN soc_budget;
```

In [53]:
pd.read_sql_query(
"WITH soc_cost (expense) AS \
    (SELECT SUM(exp.price) \
     FROM event AS e INNER JOIN expenses AS exp \
       ON e.name = exp.event \
     WHERE e.type = 'social'), \
soc_budget (budget) AS \
    (SELECT MAX(COUNT(*) * 7, 250) \
     FROM member \
     WHERE faculty = 'Math') \
SELECT expense, budget, budget - expense \
FROM soc_cost CROSS JOIN soc_budget", con)

   expense  budget  budget - expense
0   219.22     250             30.78

## CASE Expressions
__CASE expressions:__ Similar to a series of if else statements executed for every entry in a table. A new value is returned for every row in the table.

```SQL
CASE [column]
	WHEN condition1 THEN result1
	WHEN condition2 THEN result2
	...
	WHEN condition_n THEN result_n
	[ELSE result]
END
```

- The result can be of any datatype or the result of a correlated or non-correlated subquery (if the result is a single value)

- CASE expressions are performed by themselves in the __SELECT__ clause or within a function or aggregate function

    - CASE expressions within aggregate functions allow us to do counts, sums, averages, etc. of particular occurrences

__Example:__ Suppose like before we are preparing a report for MathSoc, but now we want to give a warning if the event is over budget or not.

```SQL
WITH cost (event, expenses) AS 
    (SELECT event, SUM(price) 
    FROM expenses 
    GROUP BY event) 
SELECT e.name, e.type, e.budget, cost.expenses, 
    CASE 
    WHEN e.budget - cost.expenses < 0 THEN 'Over budget' 
    ELSE NULL
END AS warning 
FROM event AS e INNER JOIN cost ON e.name = cost.event;
```

In [54]:
pd.read_sql_query(
"WITH cost (event, expenses) AS \
    (SELECT event, SUM(price) \
    FROM expenses \
    GROUP BY event) \
SELECT e.name, e.type, e.budget, cost.expenses, \
    CASE \
    WHEN e.budget - cost.expenses < 0 THEN 'Over budget' \
    ELSE NULL \
    END AS warning \
FROM event AS e INNER JOIN cost ON e.name = cost.event", con)

                             name         type budget  expenses      warning
0                Begining of Term       social   90.0     58.57         None
1                     End of Term       social  160.0    160.65  Over budget
2                 Intro to Hadoop  educational   90.0     96.81  Over budget
3                    Intro to SQL  educational   90.0    102.77  Over budget
4  Intro to SQL: Advanced Queries  educational  100.0     62.63         None
5     Intro to SQL: Basic Queries  educational  100.0     62.63         None
6                     Prof Talk 2  educational   90.0     77.21         None
7     Prof Talk: Machine Learning  educational   90.0     82.87         None

### Quiz: CASE Expressions
__Q:__ Suppose we are interested in the healthiness of our food options at Stats Club events. A score of various foods was given below. What is the average 'healthiness' of Stats Club event's food options?
- The average of the score values for all of the foods at Stats Club events.

| Food | donuts | pop | fries | pizza | cookies | coffee | water | meals | veggie platter |
|------|--------|-----|-------|-------|---------|--------|-------|-------|----------------|
| Score | -2 | -2 | -2 | -1 | -1 | 0 | 2 | 2 | 3|

```SQL
SELECT AVG(CASE 
    WHEN expense IN ('donuts', 'pop', 'fries') THEN -2
    WHEN expense IN ('pizza', 'cookies') THEN -1
    WHEN expense IN ('coffee') THEN 0
    WHEN expense IN ('water', 'meals') THEN 2
    WHEN expense IN ('veggie platter') THEN 3
END) AS avg_score
FROM expenses;
```

In [55]:
pd.read_sql_query(
"SELECT AVG(CASE \
    WHEN expense IN ('donuts', 'pop', 'fries') THEN -2 \
    WHEN expense IN ('pizza', 'cookies') THEN -1 \
    WHEN expense IN ('coffee') THEN 0 \
    WHEN expense IN ('water', 'meals') THEN 2 \
    WHEN expense IN ('veggie platter') THEN 3 \
END) AS avg_score \
FROM expenses", con)

   avg_score
0      -0.75

## ORDER BY Clause
__ORDER BY Clause:__ Rearranges the rows of a result set according to a tuple of columns.

```SQL
SELECT column_list 
FROM table_name 
ORDER BY column1, column2, .. columnN [ASC | DESC];
```
`ASC` is ascending (default)  

`DESC` is descending

__Example:__ What is the membership list ordered by name?

```SQL
SELECT name 
FROM member 
ORDER BY name;
```

In [56]:
pd.read_sql_query(
"SELECT name \
FROM member \
ORDER BY name", con)

                     name
0       Ann W. McLaughlin
1        Arnold J. Fuller
2      Austin K. Gilliard
3         Billy L. Hunter
4       Bobbie D. Mathews
5         Daniel J. Moore
6          Darrell Aucoin
7     Deborah D. Helfrich
8           Dominick Byrd
9           Elaine S. Ott
10      Frances A. Miller
11          Fred E. Finch
12          James A. Foxt
13       James M. Eddings
14       Janelle T. Smith
15         Jeff M. Wright
16        John J. Oquendo
17         Joseph L. Wood
18      Judith B. Gibbons
19      Kelly S. Ferguson
20    Melissa R. Anderson
21       Melvin O. Martin
22   Mildred F. Hottinger
23       Mina W. Lawrence
24       Nancy P. Jackson
25      Patrick Robertson
26  Phillip C. Mascarenas
27       Ralph L. Waldrop
28     Robert B. Williams
29             Ruben Lamb
30           Ryan T. Luby
31  Stephanie R. Matthews
32    Tameika M. McMaster
33       Vivian R. Donley

## LIMIT Clause
__LIMIT Clause:__ Restrict the result set to the first n of rows.

```SQL
SELECT column1, column2, columnN 
FROM table_name
LIMIT no_of_rows;
```
- We can also offset where the restriction begins  

```SQL
SELECT column1, column2, columnN 
FROM table_name
LIMIT no_of_rows OFFSET row_num;
```

__Example:__ What is the first 10 members ordered by name?

```SQL
SELECT name 
FROM member 
ORDER BY name 
LIMIT 10;
```

In [57]:
pd.read_sql_query(
"SELECT name \
FROM member \
ORDER BY name \
LIMIT 10", con)

                  name
0    Ann W. McLaughlin
1     Arnold J. Fuller
2   Austin K. Gilliard
3      Billy L. Hunter
4    Bobbie D. Mathews
5      Daniel J. Moore
6       Darrell Aucoin
7  Deborah D. Helfrich
8        Dominick Byrd
9        Elaine S. Ott

### Quiz: ORDER BY and LIMIT Clause
__Q:__ What are the top 10 highest priced items in expenses?

```SQL
SELECT expense, price
FROM expenses
ORDER BY price
LIMIT 10;
```

In [58]:
pd.read_sql_query(
"SELECT expense, price \
FROM expenses \
ORDER BY price \
LIMIT 10", con)

   expense  price
0    water  10.23
1  cookies  10.23
2  cookies  10.23
3  cookies  10.23
4    water  10.52
5    water  10.52
6      pop  13.23
7      pop  15.34
8      pop  15.65
9      pop  20.31

# Questions?
### Topics Not Covered
- How to create a database
    - Creating tables
    - Creating constraints
    - Indices
    - Views
    - How to insert, delete, alter, drop, etc. data in a table

# References
### Books:
_Learning SQL_, Second Edition, by Alan Beaulieu. Copyright 2009 O’Reilly Media, Inc., 978-0-596-52083-0.

### CS Database Courses:

__CS 338:__ Computer Applications in Business: Databases (CS Minors)

__CS 348:__ Introduction to Database Management (CS Majors)

### Coursera Courses:

__Introduction to Databases:__ by Jennifer Widom from Stanford  

__Getting and Cleaning Data:__ by Jeff Leek, PhD, Roger D. Peng, PhD, Brian Caffo, PhD from Johns Hopkins University

In [59]:
#sudo ipython nbconvert Intro_SQL_Presentation2.ipynb --to slides --post serve

## Further Practice Questions?

### Quiz: Practice Questions

__Q:__ What events have dates specified?

```SQL
SELECT name, start_time 
FROM event 
WHERE start_time IS NOT NULL;
```

In [60]:
pd.read_sql_query(
"SELECT name, start_time \
FROM event \
WHERE start_time IS NOT NULL", con)

                             name           start_time
0                Begining of Term  2015-01-28 19:00:00
1                 Intro to Hadoop  2015-03-25 14:30:00
2                    Intro to SQL  2015-02-05 18:00:00
3     Prof Talk: Machine Learning  2015-03-03 15:00:00
4     Intro to SQL: Basic Queries  2015-03-09 18:00:00
5  Intro to SQL: Advanced Queries  2015-03-12 18:00:00

__Q:__ What events don't have dates specified?

```SQL
SELECT name 
FROM event 
WHERE start_time IS NULL;
```

In [61]:
pd.read_sql_query(
"SELECT name, start_time \
FROM event \
WHERE start_time IS NULL", con)

          name start_time
0  End of Term       None
1  Prof Talk 2       None

__Q:__ What Stats Club members are in Stats, Act Sci, or CS?
- Recall the `IN` predicate operator

```SQL
SELECT name 
FROM member 
WHERE major IN ('Stats', 'Act Sci', 'CS');
```

In [62]:
pd.read_sql_query(
"SELECT name \
FROM member \
WHERE major IN ('Stats', 'Act Sci', 'CS')", con)

                     name
0          Darrell Aucoin
1            Ryan T. Luby
2         Billy L. Hunter
3   Stephanie R. Matthews
4      Robert B. Williams
5      Austin K. Gilliard
6        James M. Eddings
7           Elaine S. Ott
8           James A. Foxt
9         Daniel J. Moore
10      Kelly S. Ferguson
11       Vivian R. Donley
12      Frances A. Miller
13       Mina W. Lawrence
14  Phillip C. Mascarenas
15         Jeff M. Wright
16    Deborah D. Helfrich
17       Nancy P. Jackson
18      Bobbie D. Mathews
19       Arnold J. Fuller
20       Ralph L. Waldrop
21    Tameika M. McMaster
22    Melissa R. Anderson
23      Ann W. McLaughlin
24      Judith B. Gibbons
25             Ruben Lamb
26      Patrick Robertson

__Q:__ How many different Stats Club exec positions are there?
- Note that we can use DISTINCT within aggregate functions

```SQL
SELECT COUNT(DISTINCT position) AS num_exec_positions
FROM exec_position;
```

In [64]:
pd.read_sql_query(
"SELECT COUNT(DISTINCT position) AS num_exec_positions \
FROM exec_position", con)

   num_exec_positions
0                   5

In [65]:
#sudo ipython nbconvert Intro_SQL_Presentation.ipynb --to slides --post serve

In [66]:
con.close()